src/conf/DataProcessors/уп_ГрафикПроцедур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>уп_ГрафикПроцедур</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Процедуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_СостоянияГрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/conf/DataProcessors/уп_ГрафикПроцедур/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КодПомещения = Параметры.КодПомещения;
	Помещение = Справочники.Помещения.НайтиПоКоду(КодПомещения, Истина);
	Список = Параметры.Список;
	ВремяНачала = Параметры.ВремяНачала;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Помещение", Помещение);
	ПараметрыОтбора.Вставить("ВремяНачала", ВремяНачала);
	МассивПроцедур = Объект.Процедуры.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Проц Из Список Цикл
		НС = СписокПар.Добавить();
		НС.Сотрудник = Проц.Сотрудник;
		НС.Клиент = Проц.Клиент;
		НС.Процедура = Проц.Процедура;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция Расписание()
	МассивОтвета = Новый Массив;
	Для Каждого Строка Из СписокПар Цикл
		Если ЗначениеЗаполнено(Строка.Сотрудник) И ЗначениеЗаполнено(Строка.Клиент) И ЗначениеЗаполнено(Строка.Процедура) Тогда
			МассивОтвета.Добавить(Новый Структура("Сотрудник, Клиент, Процедура, Помещение, ВремяНачала", Строка.Сотрудник, Строка.Клиент, Строка.Процедура, Помещение, ВремяНачала));	
		КонецЕсли;
	КонецЦикла;
	Возврат МассивОтвета;
КонецФункции

&НаКлиенте
Процедура Ок(Команда)
	РасписаниеДня = Расписание();
	ОповеститьОВыборе(Новый Структура("Расписание", РасписаниеДня));
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ОповеститьОВыборе(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПолучитьКлиентовСОстаткамиПроцедурССервера()
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Время", ВремяНачала);
	ПараметрыОтбора.Вставить("Помещение", Помещение);
	ТЗ = уп_РаботаСГрафикомСервер.ПолучитьКлиентовСОстаткамиПроцедурТЗ(ПараметрыОтбора);
	СписокПар.Очистить();
	Для Каждого Клиент Из ТЗ Цикл
		НС = СписокПар.Добавить();
		НС.Клиент = Клиент.Клиент;
		НС.Процедура = Клиент.Процедура;
		НС.Сотрудник = Клиент.Сотрудник;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлиентов(Команда)
	ПолучитьКлиентовСОстаткамиПроцедурССервера();
КонецПроцедуры
